In [3]:
import pandas as pd
a=pd.DataFrame({"Name":["Lavanya","Mahi","siri","teju"],"Age":["18","17","19","Nat"],"city":["vizag","east","pd.Nat","vizag"]})
print(a)

      Name  Age    city
0  Lavanya   18   vizag
1     Mahi   17    east
2     siri   19  pd.Nat
3     teju  Nat   vizag

In [4]:
a.dropna()

      Name  Age    city
0  Lavanya   18   vizag
1     Mahi   17    east
2     siri   19  pd.Nat
3     teju  Nat   vizag

In [5]:
a.dropna(axis="columns")

      Name  Age    city
0  Lavanya   18   vizag
1     Mahi   17    east
2     siri   19  pd.Nat
3     teju  Nat   vizag

In [6]:
a.dropna(how="all")

      Name  Age    city
0  Lavanya   18   vizag
1     Mahi   17    east
2     siri   19  pd.Nat
3     teju  Nat   vizag

In [7]:
a.dropna(how="any")

      Name  Age    city
0  Lavanya   18   vizag
1     Mahi   17    east
2     siri   19  pd.Nat
3     teju  Nat   vizag

In [8]:
a.dropna(thresh=2)

      Name  Age    city
0  Lavanya   18   vizag
1     Mahi   17    east
2     siri   19  pd.Nat
3     teju  Nat   vizag

In [9]:
a.dropna(subset=["city"])

      Name  Age    city
0  Lavanya   18   vizag
1     Mahi   17    east
2     siri   19  pd.Nat
3     teju  Nat   vizag

In [16]:
b=a.fillna(0)
print(b)

      Name  Age    city
0  Lavanya   18   vizag
1     Mahi   17    east
2     siri   19  pd.Nat
3     teju  Nat   vizag

In [17]:
a['Name'].str.split(',')

0    [Lavanya]
1       [Mahi]
2       [siri]
3       [teju]
Name: Name, dtype: object

In [22]:
b=a["city"]=a["city"].str.replace('city','name')
print(b)

0     vizag
1      east
2    pd.Nat
3     vizag
Name: city, dtype: object